backend/app/Http/Controllers/ArticleController.php

    public function index()
    {
        // N+1 problem
        $articles = Article::all()->load(['user'])->load(['comments']);
---
SELECT * FROM `articles`

    public function store(StoreArticleRequest $request)
    {
        $validatedArticle = $request->validate([
            'title' => ['required', 'max:255'],
            'content' => ['required'],
            'slug' => ['prohibited'],
            'user_id' => ['required'],
        ]);

        $validatedArticle['slug'] = StringUtils::slugify($validatedArticle['title']);

        $article = new Article($validatedArticle);
        try {
            $article->save();
---
INSERT INTO `articles` (`title`, `content`, `summary`, `slug`, `updated_at`, `created_at`) VALUES ('asdasd', 'asdasd', 'asdasdasd', 'asdasd', '2022-09-19 14:54:13', '2022-09-19 14:54:13')